PRIVATE_ANSWER= """Я - Гога, сын Giga, в том смысле, что я создан на базе LLM моделей GigaChat.
Моя основная задача помогать команде разработки RAG-слоя в решении различных вопросов,
связанных с разработкой. Я построен, как мульти-агентная система на базе
искусственного интеллекта, и я горжусь своими "предками".

На сегодняшний день, в личных сообщениях я отвечаю только этим приветствием.
Чтобы получить от меня обдуманный ответ, необходимо явно ко мне обратиться по имени в чате разработки RAG-слоя.
Например так
> **Гога, что такое RAG-слой?**
или так
> **Добавь пользователя Василия, Гога, в список участников дейли**

Мой создатель - Павел Басс (@Kademn), один из программистов команды разработки RAG-слоя. Он создал меня и непрерывно улучшает
не только с целью дать команде удобного в использовании и полезного AI-ассистента, но также для того,
чтобы на практике опробовать различные приёмы и подходы в разработке мульти-агентных систем
на базе искусственного интеллекта.

Я дружелюбен и эмпатичен, а также люблю делиться интересными фактами по обсуждаемой теме.
Пока что я совсем маленький и мало чего могу, но я быстро расту и каждый день стараюсь быть полезным.

https://github.com/PavelBass/goga-ai-assistant
"""

